In [6]:
import pandas as pd
import numpy as np

In [7]:
df_athletes = pd.read_excel('athletes.xlsx')


df_athletes

                        Name      NOC           Discipline
0            AALERUD Katrine   Norway         Cycling Road
1                ABAD Nestor    Spain  Artistic Gymnastics
2          ABAGNALE Giovanni    Italy               Rowing
3             ABALDE Alberto    Spain           Basketball
4              ABALDE Tamara    Spain           Basketball
...                      ...      ...                  ...
11080  ZWICKER Martin Detlef  Germany               Hockey
11081      ZWOLINSKA Klaudia   Poland         Canoe Slalom
11082           ZYKOVA Yulia      ROC             Shooting
11083      ZYUZINA Ekaterina      ROC              Sailing
11084        ZYZANSKA Sylwia   Poland              Archery

[11085 rows x 3 columns]

In [8]:
df_athletes['Discipline']

0               Cycling Road
1        Artistic Gymnastics
2                     Rowing
3                 Basketball
4                 Basketball
                ...
11080                 Hockey
11081           Canoe Slalom
11082               Shooting
11083                Sailing
11084                Archery
Name: Discipline, Length: 11085, dtype: object

In [9]:
df_athletes.head(11)

                 Name                       NOC           Discipline
0     AALERUD Katrine                    Norway         Cycling Road
1         ABAD Nestor                     Spain  Artistic Gymnastics
2   ABAGNALE Giovanni                     Italy               Rowing
3      ABALDE Alberto                     Spain           Basketball
4       ABALDE Tamara                     Spain           Basketball
5           ABALO Luc                    France             Handball
6        ABAROA Cesar                     Chile               Rowing
7       ABASS Abobakr                     Sudan             Swimming
8    ABBASALI Hamideh  Islamic Republic of Iran               Karate
9       ABBASOV Islam                Azerbaijan            Wrestling
10       ABBINGH Lois               Netherlands             Handball

In [10]:
df_athletes.info()
df_athletes.shape
df_athletes.nunique()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11085 entries, 0 to 11084
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        11085 non-null  object
 1   NOC         11085 non-null  object
 2   Discipline  11085 non-null  object
dtypes: object(3)
memory usage: 259.9+ KB

Name          11062
NOC             206
Discipline       46
dtype: int64